# Напишите программу, которая заполняет массив из 5 элементов пользовательским вводом
# и выводит этот массив.

arr_list=[]
print('Введите числа:')
arr_list.append(input())
arr_list.append(input())
arr_list.append(input())
arr_list.append(input())
arr_list.append(input())
print(arr_list)