# Дан массив: 1, 2, 3, 4, 5. Инвертировать порядок элементов в массиве

arr_list = [1, 2, 3, 4, 5]
arr_list.reverse()

print("Инвертированный порядок элементов в массиве: " + ' '.join(str(el) for el in arr_list))