# Дан список строк "apple", "orange", "banana", "pineapple", "grape". Отсортировать
# его в порядке, обратном алфавитному.

newList = ["apple", "orange", "banana", "pineapple", "grape"]

newList.sort(reverse=True)

print("Список, отсортированный в обратном алфовитному порядку: ",  newList)