# Создайте функцию, которая принимает на вход строку и возвращает ее в обратном
# порядке.

def reverse_string(str):
    return "".join(reversed(str))


print(reverse_string("flugogenheim"))