# Дан список целых чисел 5, 1, 10, 3, 7. Отсортировать его в порядке возрастания и
# вернуть в виде кортежа.

newList = [5, 1, 10, 3, 7]
newList.sort()

print("Отсортированный кортеж: ", tuple(newList))