# Напишите программу, которая выводит список файлов в текущей директории.

import os

print(os.listdir(path='.'))