# Создайте программу, которая принимает две строки в качестве входных данных и
# выводит на экран первые буквы обеих строк в верхнем регистре.

def get_cap_letter(str1, str2):
    print(str1[0].upper() + " " + str2[0].upper())


get_cap_letter("ойойой", "чтотуттвориться")